#+title: Segwit transaction by hand
#+subtitle: Bitcoin
#+date: 2021-11-25
#+tags[]: bitcoin segwit transaction

Lets hand craft a SegWit transaction using only [[https://docs.python.org/3/library/functions.html][built-in Python3 functions]] for hex/bytes manipulation and [[https://sagemath.org][Sagemath]] for elliptic curves arithmetic.

** 0. Utils
   First thing first, a base class /Segwit/ that provides hex representation for all instances
   and a few utility functions to transform /int/hex/ to /bytes/ and vice-versa.

   Last, /decode/ function decodes a /Bech32/ address into RIPEMD160 representation. See [[/post/2020-02-10-bitcoin-bech32-segwit-address/][Bech32 segwit address]] blog post for more details, it's not alien, it is just ZSH script code.

   #+begin_src python :session segwit-python :results output
     class Segwit(object):
       def hex(self) -> str:
         return bytes(self).hex()

     def int_to_bytes(x: int, length: int) -> bytes:
       return x.to_bytes(length, byteorder="little")
     def bytes_to_int(b: bytes) -> int:
       return int.from_bytes(b, byteorder="big")
     def hex_to_bytes(s: str) -> bytes:
       return bytes.fromhex(s)
     import hashlib
     def hash256(preimage: bytes) -> bytes:
       return hashlib.sha256(hashlib.sha256(preimage).digest()).digest()

     CHARSET = "qpzry9x8gf2tvdw0s3jn54khce6mua7l"
     CHARSET_BASE = len(CHARSET)
     def decode(addr: str) -> str:
       data = reversed(addr[4:-6])
       return '%x' % sum([CHARSET.find(c) * CHARSET_BASE**i for i, c in enumerate(data)])

     print(int_to_bytes(1, 4).hex())
     print(decode("tb1qm0r8qe0lxs8yf9tywxjtskntvdkzywsx2cacr2"))
   #+end_src

   #+RESULTS:
   : 01000000
   : dbc67065ff340e44956471a4b85a6b636c223a06

   mind:
   - /hex/ method that takes bytes of derived instances and spits out hex
   - /little endian/ integer representation: /0x01000000/ instead of /0x00000001/

*** Txout
    These are the outputs that we want to send the /Satoshis/ to:
    - /50_000/ satoshi - to "tb1q65kw8v97qm6r753a7cv6hqtddcdwhtu360pjqd"
    - /49_817/ satoshi - this is the change that comes back to us but to a different address
    - address - the address to send to

    #+begin_src python :session segwit-python :results output
      class Txout(Segwit):
        def __init__(self, amount, address):
          self.amount = int_to_bytes(amount, 8)
          self.script = Script.p2wpkh(address)
        def __bytes__(self) -> bytes:
          size = int_to_bytes(len(self.script), 1)
          return self.amount + size + self.script

      txout1 = Txout(amount=49817, address="tb1q65kw8v97qm6r753a7cv6hqtddcdwhtu360pjqd")
      txout2 = Txout(amount=50000, address="tb1qm0r8qe0lxs8yf9tywxjtskntvdkzywsx2cacr2")
      print(txout1.hex())
      print(txout2.hex())
    #+end_src

    #+RESULTS:
    : 99c2000000000000160014d52ce3b0be06f43f523df619ab816d6e1aebaf91
    : 50c3000000000000160014dbc67065ff340e44956471a4b85a6b636c223a06

    - the miner fee is the difference: /100_000/ (input amount) - /50_000/ + /49_817/

*** Validate

    And finally, the moment of the truth, with the signature generated above, create the /witness/, set it into tx and validate the final /tx hex/ using /bitcoin-cli/ and /decoderawtransaction/.

    #+header: :var signature=signature()
    #+header: :var public_key=public_key()
    #+begin_src python :session segwit-python :results output
      def witness(signature) -> str:
        ver = bytearray([0x02])
        sig = hex_to_bytes(signature)
        sig_size = int_to_bytes(len(sig), 1)
        pubkey = hex_to_bytes(public_key)
        pubkey_size = int_to_bytes(len(pubkey), 1)
        return ver + sig_size + sig + pubkey_size + pubkey

      tx.witness = witness(signature)
      tx_hex = tx.hex()
      print("Signed TX: " + tx_hex)

      import subprocess
      process = subprocess.run(["bitcoin-cli", "decoderawtransaction", tx_hex], capture_output=True)
      print(process.stdout)
      print(process.stderr)
    #+end_src

    #+RESULTS:
    : Signed TX: 0200000000010125cdfe141889542e6f52a47e2e89ec5689a90f4bd6c2b8cbf28c16dde5ce2ffd0000000000feffffff0299c2000000000000160014d52ce3b0be06f43f523df619ab816d6e1aebaf9150c3000000000000160014dbc67065ff340e44956471a4b85a6b636c223a0602473044022054b3d785c62432f341bba6e14a818c97ab32e8d24414d0aafa9a8a1a2d86b8f802200e4122267fbe68021295b5764eb651e40fff562758cfbba0675eccdb8265ce49012102312e22e2bb3591647b4b97ea6f98dd16b216bb3ad473759282a3de33605106fc56f60000
    : b'{\n  "txid": "cf2d115be7eb6f3a7ce98702d01cc4e6bf5a79c45a5796d1a2adb1c988c0511d",\n  "hash": "b2b884e70fdc2fdf8d7062df78a63ffc4549cfe8ee32ebd913631048136d143a",\n  "version": 2,\n  "size": 222,\n  "vsize": 141,\n  "weight": 561,\n  "locktime": 63062,\n  "vin": [\n    {\n      "txid": "fd2fcee5dd168cf2cbb8c2d64b0fa98956ec892e7ea4526f2e54891814fecd25",\n      "vout": 0,\n      "scriptSig": {\n        "asm": "",\n        "hex": ""\n      },\n      "txinwitness": [\n        "3044022054b3d785c62432f341bba6e14a818c97ab32e8d24414d0aafa9a8a1a2d86b8f802200e4122267fbe68021295b5764eb651e40fff562758cfbba0675eccdb8265ce4901",\n        "02312e22e2bb3591647b4b97ea6f98dd16b216bb3ad473759282a3de33605106fc"\n      ],\n      "sequence": 4294967294\n    }\n  ],\n  "vout": [\n    {\n      "value": 0.00049817,\n      "n": 0,\n      "scriptPubKey": {\n        "asm": "0 d52ce3b0be06f43f523df619ab816d6e1aebaf91",\n        "hex": "0014d52ce3b0be06f43f523df619ab816d6e1aebaf91",\n        "address": "tb1q65kw8v97qm6r753a7cv6hqtddcdwhtu360pjqd",\n        "type": "witness_v0_keyhash"\n      }\n    },\n    {\n      "value": 0.00050000,\n      "n": 1,\n      "scriptPubKey": {\n        "asm": "0 dbc67065ff340e44956471a4b85a6b636c223a06",\n        "hex": "0014dbc67065ff340e44956471a4b85a6b636c223a06",\n        "address": "tb1qm0r8qe0lxs8yf9tywxjtskntvdkzywsx2cacr2",\n        "type": "witness_v0_keyhash"\n      }\n    }\n  ]\n}\n'
    : b''

    Voila! Valid TX!

